ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/common/udb-sdio-whd/COMPONENT_UDB_SDIO_P2/SDIO_HOST_cfg.h
/***************************CMD DMA***************************************/
#define SDIO_HOST_CMD_DMA_DW_BLOCK       (0u)
#define SDIO_HOST_CMD_DMA_DW_CHANNEL     (1u)
#define SDIO_HOST_CMD_DMA_HW             (DW0)
#define SDIO_HOST_CMD_DMA_INTR_MASK      (CY_DMA_INTR_MASK)

/* Channel settings */
#define SDIO_HOST_CMD_DMA_PRIORITY       (1u)
#define SDIO_HOST_CMD_DMA_DESCRIPTOR_NUM (1u)
#define SDIO_HOST_CMD_DMA_PREEMPTABLE    (true)

extern cy_stc_dma_descriptor_config_t SDIO_HOST_CMD_DMA_CMD_DMA_Desc_config;
extern cy_stc_dma_descriptor_t SDIO_HOST_CMD_DMA_CMD_DMA_Desc;

/***************************Read DMA***************************************/
#define SDIO_HOST_Read_DMA_DW_BLOCK       (1u)
#define SDIO_HOST_Read_DMA_DW_CHANNEL     (3u)
#define SDIO_HOST_Read_DMA_HW             (DW1)
#define SDIO_HOST_Read_DMA_INTR_MASK      (CY_DMA_INTR_MASK)

/* Channel settings */
#define SDIO_HOST_Read_DMA_PRIORITY       (0u)
#define SDIO_HOST_Read_DMA_DESCRIPTOR_NUM (1u)
#define SDIO_HOST_Read_DMA_PREEMPTABLE    (false)

extern cy_stc_dma_descriptor_config_t SDIO_HOST_Read_DMA_Read_DMA_Desc_config;
extern cy_stc_dma_descriptor_t SDIO_HOST_Read_DMA_Read_DMA_Desc;

/***************************Resp DMA***************************************/
#define SDIO_HOST_Resp_DMA_DW_BLOCK       (0u)
#define SDIO_HOST_Resp_DMA_DW_CHANNEL     (0u)
#define SDIO_HOST_Resp_DMA_HW             (DW0)
#define SDIO_HOST_Resp_DMA_INTR_MASK      (CY_DMA_INTR_MASK)

/* Channel settings */
#define SDIO_HOST_Resp_DMA_PRIORITY       (1u)
#define SDIO_HOST_Resp_DMA_DESCRIPTOR_NUM (1u)
#define SDIO_HOST_Resp_DMA_PREEMPTABLE    (true)

extern cy_stc_dma_descriptor_config_t SDIO_HOST_Resp_DMA_Resp_DMA_Desc_config;
extern cy_stc_dma_descriptor_t SDIO_HOST_Resp_DMA_Resp_DMA_Desc;

/***************************Write DMA***************************************/
#define SDIO_HOST_Write_DMA_DW_BLOCK       (1u)
#define SDIO_HOST_Write_DMA_DW_CHANNEL     (1u)
#define SDIO_HOST_Write_DMA_HW             (DW1)
#define SDIO_HOST_Write_DMA_INTR_MASK      (CY_DMA_INTR_MASK)

/* Channel settings */
#define SDIO_HOST_Write_DMA_PRIORITY       (0u)
#define SDIO_HOST_Write_DMA_DESCRIPTOR_NUM (1u)
#define SDIO_HOST_Write_DMA_PREEMPTABLE    (false)

extern cy_stc_dma_descriptor_config_t SDIO_HOST_Write_DMA_Write_DMA_Desc_config;
extern cy_stc_dma_descriptor_t SDIO_HOST_Write_DMA_Write_DMA_Desc;

/***************************SDIO Clock**************************************/
/* The peripheral clock divider number */
#define SDIO_HOST_Internal_Clock_DIV_NUM ((uint32_t)0)
/* The peripheral clock divider type */
#define SDIO_HOST_Internal_Clock_DIV_TYPE ((cy_en_divider_types_t)CY_SYSCLK_DIV_8_BIT)

/*Function for configuring TriggerMuxes*/
void SDIO_Host_Config_TriggerMuxes(void);

/*Function for configuring UDBs*/
void SDIO_Host_Config_UDBs(void);

/* SDIO_HOST_Read_Int */
#define SDIO_HOST_Read_Int__INTC_CORTEXM4_ASSIGNED 1
#define SDIO_HOST_Read_Int__INTC_CORTEXM4_PRIORITY 7u
#define SDIO_HOST_Read_Int__INTC_NUMBER 69u
#define SDIO_HOST_Read_Int_INTC_CORTEXM4_ASSIGNED 1
#define SDIO_HOST_Read_Int_INTC_CORTEXM4_PRIORITY 7u
#define SDIO_HOST_Read_Int_INTC_NUMBER 69u

/* SDIO_HOST_sdio_int */
#define SDIO_HOST_sdio_int__INTC_CORTEXM4_ASSIGNED 1
#define SDIO_HOST_sdio_int__INTC_CORTEXM4_PRIORITY 7u
#define SDIO_HOST_sdio_int__INTC_NUMBER 122u
#define SDIO_HOST_sdio_int_INTC_CORTEXM4_ASSIGNED 1
#define SDIO_HOST_sdio_int_INTC_CORTEXM4_PRIORITY 7u
#define SDIO_HOST_sdio_int_INTC_NUMBER 122u

/* SDIO_HOST_Write_Int */
#define SDIO_HOST_Write_Int__INTC_CORTEXM4_ASSIGNED 1
#define SDIO_HOST_Write_Int__INTC_CORTEXM4_PRIORITY 7u
#define SDIO_HOST_Write_Int__INTC_NUMBER 67u
#define SDIO_HOST_Write_Int_INTC_CORTEXM4_ASSIGNED 1
#define SDIO_HOST_Write_Int_INTC_CORTEXM4_PRIORITY 7u
#define SDIO_HOST_Write_Int_INTC_NUMBER 67u

#if defined(__cplusplus)
}
#endif

#endif /* !defined(CY_SDIO_CFG_H) */

/* [] END OF FILE */
